/*
SQLyog v10.2 
MySQL - 5.7.36-0ubuntu0.18.04.1 : Database - mytest
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`mytest` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `mytest`;

/*Table structure for table `persons` */

DROP TABLE IF EXISTS `persons`;

CREATE TABLE `persons` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `name` varchar(10) DEFAULT NULL COMMENT '姓名',
  `age` int(10) DEFAULT NULL COMMENT '年龄',
  `sex` varchar(5) DEFAULT NULL COMMENT '性别',
  `address` varchar(50) DEFAULT NULL COMMENT '住址',
  `sect` varchar(10) DEFAULT NULL COMMENT '门派',
  `skill` varchar(10) DEFAULT NULL COMMENT '绝技',
  `power` int(10) DEFAULT NULL COMMENT '战力值',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `modify_time` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '修改时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=451 DEFAULT CHARSET=utf8;

/*Data for the table `persons` */

insert  into `persons`(`id`,`name`,`age`,`sex`,`address`,`sect`,`skill`,`power`,`create_time`,`modify_time`) values (427,'张无忌',16,'男','昆仑山光明顶','明教','九阳神功',99,'2021-11-26 16:29:38','2021-11-26 16:29:38'),(428,'赵敏',13,'女','大都','朝廷','杂门武功',30,'2021-11-26 16:32:15','2021-11-26 16:32:15'),(429,'周芷若',13,'女','峨眉山','峨嵋派','九阴真经',80,'2021-11-26 16:32:40','2021-11-26 16:32:40'),(430,'小昭',12,'女','昆仑山光明顶','明教','乾坤大挪移',40,'2021-11-26 16:33:27','2021-11-26 16:33:27'),(431,'殷离',12,'女','峨眉山','天鹰教','千蛛万毒手',50,'2021-11-26 16:36:12','2021-11-26 16:36:12'),(432,'杨逍',30,'男','昆仑山光明顶','明教','乾坤大挪移',80,'2021-11-26 17:12:10','2021-11-26 17:12:10'),(433,'范遥',29,'男','昆仑山光明顶','明教','吸星大法',79,'2021-11-26 17:14:03','2021-11-26 17:14:03'),(434,'谢逊',31,'男','冰火岛','明教','七伤拳',79,'2021-11-26 17:15:40','2021-11-26 17:15:40'),(435,'殷天正',40,'男','峨眉山','天鹰教','鹰爪擒拿手',75,'2021-11-26 17:16:49','2021-11-26 17:16:49'),(436,'黛绮丝',35,'女','灵蛇岛','明教','波斯武学',72,'2021-11-26 17:18:48','2021-11-26 17:18:48'),(437,'韦一笑',40,'男','昆仑山光明顶','明教','寒冰绵掌',68,'2021-11-26 17:19:45','2021-11-26 17:19:45'),(438,'宋远桥',41,'男','武当山','武当派','太极功',78,'2021-11-26 17:23:47','2021-11-26 17:23:47'),(439,'俞莲舟',39,'男','武当山','武当派','太极功',75,'2021-11-26 17:24:29','2021-11-26 17:24:29'),(440,'俞岱岩',38,'男','武当山','武当派','太极功',75,'2021-11-26 17:24:55','2021-11-26 17:24:55'),(441,'张松溪',37,'男','武当山','武当派','太极功',75,'2021-11-26 17:25:41','2021-11-26 17:25:41'),(442,'张翠山',36,'男','冰火岛','武当派','太极功',77,'2021-11-26 17:26:10','2021-11-26 17:26:10'),(443,'殷梨亭',33,'男','武当山','武当派','太极功',76,'2021-11-26 17:26:37','2021-11-26 17:26:37'),(444,'莫声谷',30,'男','武当山','武当派','太极功',70,'2021-11-26 17:27:03','2021-11-26 17:27:03'),(445,'空见',50,'男','少林寺','少林派','少林龙爪手',80,'2021-11-26 17:29:06','2021-11-26 17:29:06'),(446,'空闻',49,'男','少林寺','少林派','大力金刚指',80,'2021-11-26 17:30:00','2021-11-26 17:30:00'),(447,'空智',47,'男','少林寺','少林派','少林九阳功',82,'2021-11-26 17:30:56','2021-11-26 17:30:56'),(448,'空性',45,'男','少林寺','少林派','少林七十二绝技',78,'2021-11-26 17:31:57','2021-11-26 17:31:57'),(449,'殷素素',33,'女','冰火岛','天鹰教','杂学',65,'2021-11-26 17:32:53','2021-11-26 17:32:53'),(450,'灭绝师太',33,'女','峨眉山','峨嵋派','峨嵋剑法',80,'2021-11-26 17:33:41','2021-11-26 17:33:41');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
